<?php

require_once ('sasha-lib.php');
$requestParams = getRequestParams($argv);



$info = getUser($requestParams["email"]);

if ($info == true) {
    $info["balance"] = readline("Ввести новой баланс:");
    updateUser($info);
    writeline("Збереження пройшло успішно!");
 } else {
    writeline("Ви ввели не існуючий емейл, спробуйте ще раз" . PHP_EOL);
}



//
/**
 * 1. Візьми юзера по введеному емейлу
 * 2. зміни масиву юзера баланс
 * 3. Збережи новий масив юзера за допомогою функцію updateUser()
 * 4. Після виконнаня задач, подивись що можна покращити, щоб я
 * ніколи не побчив PHP помилок, але бачив тільки твої
 *
 * Доробити:
 * 1. Позбутися використання readline - хочу шоб програма запускалась їй передати емейл і баланс
 * 1.2. На початку програми провірити чи було введено емейл і баланс, якшо ні, вивести попередження
 * і вийти з програми (можна для цього використати команду exit(), але заодно їй можна передати
 * строку з якою програма закриється - прочитати в мануалі як)
 * 3. (останнє) Провірити вхідні параметри емейл та баланс на тип строка і інтеджер -
 * береш емейл, переводиш його в тип строку, і звіряєш зі старим значенням строки,
 * якщо вони рівні значить це була строка
 * для балансу береш строку, переводиш її у інтеджер, звіряєш зі старим значенням,
 * якщо вони рівні значить ввели то шо треба (запитаєш в мене я поясню)
 *
 */