<?php

require_once ('sasha-lib.php');
$requestParams = getRequestParams($argv);
$balance = $requestParams['name'];
$requestParams['balance'] = $balance;
unset($balance);
unset($requestParams['name']);





if ($requestParams["email"] == null) {
    writeline("Ви не ввели емейл, спробуйте ще раз");
    exit();
}
if ($requestParams["balance"] == null) {
    writeline("Ви не ввели баланс, спробуйте ще раз");
    exit();
}

$foo = is_numeric($requestParams["balance"]);
if (!$foo) {
    writeline("Ви ввели не числове значення балансу");
}




$user = getUser($requestParams["email"]);
if ($user) {
    $name = $user["name"];
    $updateUserInfo = ["email" => $requestParams["email"], "name" => $name, "balance" => $requestParams["balance"]];
    updateUser($updateUserInfo);
    writeline("Збереження пройшло успішно!");
} else {
    writeline("Ви ввели не існуючий емейл, спробуйте ще раз");
}













//
/**
 * 1. Візьми юзера по введеному емейлу
 * 2. зміни масиву юзера баланс
 * 3. Збережи новий масив юзера за допомогою функцію updateUser()
 *
 * 4. Після виконнаня задач, подивись що можна покращити, щоб я
 * ніколи не побчив PHP помилок, але бачив тільки твої
 *
 * Доробити:
 * 1. Позбутися використання readline - хочу шоб програма запускалась їй передати емейл і баланс
 * 1.2. На початку програми провірити чи було введено емейл і баланс, якшо ні, вивести попередження
 * і вийти з програми (можна для цього використати команду exit(), але заодно їй можна передати
 * строку з якою програма закриється - прочитати в мануалі як)
 * 3. (останнє) Провірити вхідні параметри емейл та баланс на тип строка і інтеджер -
 * береш емейл, переводиш його в тип строку, і звіряєш зі старим значенням строки,
 * якщо вони рівні значить це була строка
 * для балансу береш строку, переводиш її у інтеджер, звіряєш зі старим значенням,
 * якщо вони рівні значить ввели то шо треба (запитаєш в мене я поясню)
 *
 */